Revit 2026 API

# PaperSourceSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PaperSourceSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
PaperSourceSetIterator()
```
```fsharp
new : unit -> PaperSourceSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

PaperSourceSetIterator Class

Autodesk.Revit.DB Namespace